{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "Admission",
        "patterns": [
          "How do I confirm my acceptance of the admission offer from the University of Ghana?",
          "How do i confirm admission?",
          "What do i do after admission?",
          "What do i do after recieving admission letter?"
        ],
        "responses": [
            "To confirm your acceptance, log in to the University of Ghana's admission portal using the credentials provided in your admission letter. Follow the instructions to complete the acceptance process online.",
            "You can confirm your acceptance by completing the confirmation form included in your admission packet and mailing it to the address specified in the admission letter.",
            "Visit the University of Ghana's admission office in person and submit your acceptance in hard copy."
        ]
      },
      {
        "tag": "Admission_deadline",
        "patterns": [
          "What is the deadline to confirm my acceptance?",
          "What is the deadline to confirm my admission?",
          "When do I need to confirm my acceptance by?",
          "When do I need to confirm my admission by?"
        ],
        "responses": [
            "The deadline to confirm your acceptance will be clearly stated in your admission letter. Please refer to the specified date to ensure timely confirmation.",
            "The deadline to accept the admission offer is usually within two weeks from the date of receipt of your admission letter.",
            "The exact deadline to confirm your acceptance will be provided on the University of Ghana's official website. Please check the admission section for the most up-to-date information."
        ]
      },
      {
        "tag": "fees",
        "patterns": [
          "What are the required fees for enrollment at the University of Ghana?",
          "What are the required fees for enrollment",
          "What fee do i pay after admission?"
          
        ],
        "responses": [
            "The required fees vary depending on your program of study. You can find detailed information about the tuition fees, registration fees, and other charges on the University of Ghana's official website or in the admission brochure.",
            "The fee structure for each program is available on the University of Ghana's student portal. Log in to your account to access the specific fee details for your program.",
            "The fee schedule will be provided along with your admission letter. Review the document carefully to understand the breakdown of fees and payment deadlines."
        ]
      },

      {
        "tag": "payments",
        "patterns": [
            "How do I pay the tuition fees and other charges?",
            "How do I pay school fees?",
            "where do I pay school fees?",
            "where can I pay school fees?",
            "where can I pay my fees?"
        ],
        "responses": [
            "The University of Ghana provides various payment methods, including bank transfers, mobile money, and online payment platforms. Refer to the payment instructions provided in your admission letter or on the university's website for specific details.",
            "Payment can be made through designated bank branches. The admission letter will contain bank account details and instructions for fee payment.",
            "You can pay the fees online through the University of Ghana's student portal. Log in to your account and follow the steps to make an online payment."
        ]
      },
      {
        "tag": "payment_plan",
        "patterns": [
            "Can I request a payment plan for the fees?",
            "is there a payment plan for the fees?"
        ],
        "responses": [
            "The University of Ghana does not typically offer payment plans for tuition fees. However, it's best to contact the university's finance or bursary office directly to discuss any special circumstances or potential options for payment arrangements.",
            "In exceptional cases, such as financial hardship, the University of Ghana may consider payment plan requests on a case-by-case basis. Reach out to the finance or bursary office for further guidance and support.",
            "To discuss the possibility of a payment plan, contact the finance or bursary office as soon as possible. They will provide you with information on whether such arrangements are available and how to proceed."
        ]
      },
      {
        "tag": "scholarships",
        "patterns": [
            "Are there any scholarships or financial aid opportunities available?",
            "Does University of ghana offer scholarships?",
            "Does University of ghana offer financial aid?"
        ],
        "responses": [
            "Yes, the University of Ghana offers various scholarships and financial aid opportunities for both domestic and international students. Information about scholarships can be found on the university's website or by contacting the scholarships office.",
            "The university provides merit-based scholarships, need-based financial aid, and other grants. Visit the University of Ghana's financial aid office or website for detailed information on available opportunities and application procedures.",
            "Scholarship opportunities may be available through external organizations as well. Check with the University of Ghana's scholarship office or the respective department for any additional funding options."
        ]
      },
      {
        "tag": "Accommodation",
        "patterns": [
            "How do I apply for on-campus accommodation?",
            "How do I register for accommodation?",
            "What are the accomodation options available at the University of Ghana?"
        ],
        "responses": [
            "To apply for on-campus accommodation, you need to complete the online housing application form. The form can be accessed through the University of Ghana's student portal or the official housing website.",
            "Visit the University of Ghana's housing office and complete the application form in person. The housing office will provide further instructions on submission and payment.",
            "Carefully review the housing application instructions provided with your admission letter. Follow the outlined steps to submit your application online or by mail.",
            "The University of Ghana offers various housing options, including residence halls on campus. These halls provide shared rooms or single occupancy rooms with communal facilities such as kitchens, bathrooms, and common areas.",
            "Apart from on-campus residence halls, there are also affiliated private hostels and accommodations near the university that students can consider. The housing office can provide a list of these options and guidance on how to apply.",
            "The university's housing office can provide detailed information about the different housing options available, including the costs, amenities, and proximity to campus. Visit their website or contact them directly for comprehensive information."
        ]
      },
      {
        "tag": "orientation",
        "patterns": [
            "When will I receive information about orientation for new students?",
            "When is orientation?"
        ],
        "responses": [
            "Information about the orientation program for new students will be communicated to you via email or through the University of Ghana's student portal approximately one month before the start of the academic year.",
            "The exact dates and details of the orientation program will be provided in your admission letter. Keep an eye on your email and the university's official communication channels for updates.",
            "The University of Ghana typically conducts orientation sessions for new students during the week before the start of classes. Please refer to the university's official website or contact the orientation office for the most accurate information."
        ]
      },
      {
        "tag": "admission_letter",
        "patterns": [
            "How can I access my admission letter online?",
            "How can I download my admission letter online?"
        ],
        "responses": [
            "You can access your admission letter by logging in to the University of Ghana's student portal using the credentials provided to you during the admission process. Once logged in, navigate to the 'Admission' section to view and download your admission letter.",
            "The admission letter can be accessed and downloaded from the University of Ghana's official admission website. Use the login credentials provided in the admission notification to access your letter.",
            "If you are unable to find or access your admission letter online, contact the admission office directly. They will assist you in retrieving a copy or provide alternative methods for accessing your admission letter."
        ]
      },
      {
        "tag": "Course_Registration",
        "patterns": [
            "How do I choose my courses for the upcoming semester?",
            "which courses should i register?",
            "how many courses should i register?"
        ],
        "responses": [
            "Course selection is typically done through the University of Ghana's student portal. Log in to your account, navigate to the registration section, and follow the instructions for selecting your courses based on your program requirements.",
            "Consult the course catalog and program requirements for your specific program of study. Make a list of the required courses and any electives or options available. Use this information to guide your course selection process.",
            "Reach out to your academic advisor or department to seek guidance on course selection. They can provide valuableinsights and help you choose the appropriate courses for your program."
        ]
      },
      {
        "tag": "Course_change",
        "patterns": [
            "Can I change my major after being admitted?",
            "Can I change my course after being admitted?",
            "Can I defer my course after being admitted?"
        ],
        "responses": [
            "Yes, it is possible to change your major after being admitted to the University of Ghana. However, the process and availability of changing majors may vary depending on the specific program and department. Contact your academic advisor or the admissions office for guidance on the procedure.",
            "Changing your major is subject to certain conditions and restrictions. It is recommended to consult with your academic advisor or the department offering the desired major to understand the possibilities and requirements for switching programs.",
            "The University of Ghana allows students to change their major within a specified timeframe. Contact the admissions office or the academic affairs office for detailed information and guidance on the process."
        ]
      },
      {
        "tag": "prerequisites",
        "patterns": [
            "Are there any prerequisites or placement tests for specific courses?",
            "what are the prerequisite for my courses?"
        ],
        "responses": [
            "Some courses at the University of Ghana may have prerequisites or require students to take placement tests. Consult the course catalog and program requirements to determine if any specific prerequisites or placement tests are necessary for the courses you are interested in.",
            "Prerequisites and placement test requirements will be clearly stated in the course descriptions and program requirements. Carefully review the information provided to ensure you meet the necessary criteria for enrollment in specific courses.",
            "For courses with prerequisites or placement tests, the University of Ghana may provide alternative options or remedial courses to fulfill the requirements. Contact the department offering the course or the academic affairs office for further guidance."
        ]
      },
      {
        "tag": "add_and_drop",
        "patterns": [
            "Can I add or drop courses after the registration period?",
            "how do i drop a course?",
            "can i drop a course?"
        ],
        "responses": [
            "The University of Ghana usually allows a specific add/drop period after the initial course registration. During this period, you can add or drop courses through the student portal without incurring any penalties. Be sure to check the academic calendar or contact the academic affairs office for the exact dates.",
            "Adding or dropping courses after the registration period may require approval from your academic advisor or the department offering the course. Reach out to them to discuss your options and seek guidance on the necessary procedures.",
            "It is important to note that adding or dropping courses after the registration period may have implications on your academic progress, financial obligations, and graduation timeline. Consult with your academic advisor or the relevant office to understand the consequences and procedures involved."
        ]
      },
      {
        "tag": "credits",
        "patterns": [
            "How many credits should I take per semester?",
            "How many credits can I take per semester?",
            "How many credits can I take a semester?",
            "How many credits am i supposed to take?",
            "what are my credits?"
        ],
        "responses": [
            "The number of credits you should take per semester may vary depending on your program of study and academic load. Refer to the program requirements or consult with your academic advisor to determine the recommended credit hours for your specific program.",
            "Most undergraduate programs at the University of Ghana require students to take between 15 to 18 credit hours per semester. However, it is crucial to check with your academic advisor or department to ensure you meet the minimum credit requirements for your program.",
            "The University of Ghana may have specific regulations regarding the maximum number of credits allowed per semester. It is important to consider factors such as course workload, extracurricular activities, and personal commitments when determining the appropriate credit hours to take."
        ]
      },
      {
        "tag": "online_course_registration",
        "patterns": [
            "What is the process for registering for courses online?",
            "Can i register my courses online?",
            "How do i register my courses online?",
            "steps to register my courses online?"
        ],
        "responses": [
            "Course registration is typically done through the University of Ghana's student portal. Log in to your account, navigate to the registration section, and follow the step-by-step instructions provided to select and enroll in your desired courses.",
            "The University of Ghana may conduct online registration workshops or provide tutorial videos to guide students through the course registration process. Check the student portal or the university's academic resources for any available support materials.",
            "It is important to be aware of the registration period specified by the university. Ensure that you log in to the student portal during the designated registration window to secure your preferred courses.",
            "1. Access the MIS Portal: Visit the University of Ghana's official website and navigate to the MIS portal or student portal. This is where you'll typically find the course registration system. 2. Login: Use your student credentials to log in to the MIS portal. Your username and password will be provided to you by the university. 3. Course Selection: Once logged in, you should be able to access the course registration section. Here, you'll likely find information about the available courses, course schedules, and any prerequisites. 4. Select Courses: Choose the courses you want to register for based on your program requirements and academic goals. Make sure to consider prerequisites, course timings, and any restrictions. 5. dd Courses to Cart: Some registration systems allow you to add courses before finalizing your registration. This gives you a chance to review your selections before confirming."
        ]
      },
      {
        "tag": "application",
        "patterns": [
            "How much does the application fee cost?",
            "what is the cost of application?",
            "How much is the application fee?"
        ],
        "responses": [
            "The application fee is reviewed periodically. Presently the application fee is GH¢200.00 for Ghanaians and US$110.00 for international students and Ghanaians living abroad.",
            "The application fee undergoes regular assessments. At the moment, the application fee stands at GH¢200.00 for Ghanaian citizens and US$110.00 for international students and Ghanaians residing abroad.",
            "The application fee undergoes regular assessments. At the moment, the application fee stands at GH¢200.00 for Ghanaian citizens and US$110.00 for international students and Ghanaians residing overseas."
        ]
      },
      {
        "tag": "application_e-voucher",
        "patterns": [
            "Where can i get the University of Ghana application e-vouchers to buy?",
            "From where can e-vouchers for University of Ghana applications be acquired?",
            "Where can i purchase the University of Ghana application e-vouchers to buy?",
            "Where can i buy the University of Ghana application e-vouchers to buy?"
        ],
        "responses": [
            "The e-voucher can be purchased from various banks including Ecobank, Agricultural Development Bank, Republic Bank, Prudential Bank, Fidelity Bank, Universal Merchant Bank, GCB Bank, Consolidated Bank Ghana (CBG), and Zenith Bank. Additionally, it's possible to acquire the e-voucher using the Momo short code *187*18# on all mobile networks.",
            "You have the choice to obtain the e-voucher from various banks such as Ecobank, Agricultural Development Bank, Republic Bank, Prudential Bank, Fidelity Bank, Universal Merchant Bank, GCB Bank, Consolidated Bank Ghana (CBG), and Zenith Bank. Additionally, you can opt to purchase the e-voucher through the Momo short code *187*18# accessible on all networks."
        ]
      },
      {
        "tag": "Nov/Dec",
        "patterns": [
            "Do you admit students with Nov/Dec results?",
            "Do you accept students with Nov/Dec results?"
            
        ],
        "responses": [
          "Yes, we do.",
          "Certainly, we admit students who possess NOV/DEC examination results.",
          "Yes, we do admit students who have NOV/DEC examination results."
        ]
      },
      {
        "tag": "wassce",
        "patterns": [
            "Do I have to enter my WASSCE results when applying?",
            "would I have to type in my WASSCE results when applying?",
            "do I have to type in my WASSCE results when applying?",
            "should I have to submit my WASSCE results when applying?",
            "Do I have to include my WASSCE results when applying?"
            
        ],
        "responses": [
          "Yes, we do.",
          "Certainly, we admit students who possess NOV/DEC examination results.",
          "Yes, we do admit students who have NOV/DEC examination results."
        ]
      },
        {
            "tag": "application_fee",
            "patterns": [
                "How much does the application fee cost?",
                "What is the cost of the application fee?",
                "How expensive is the application fee?"
            ],
            "responses": [
                "The application fee is reviewed periodically. Presently the application fee is GH¢200.00 for Ghanaians and US$110.00 for international students and Ghanaians living abroad."
            ]
        },
        {
            "tag": "multiple_results",
            "patterns": [
                "Can one apply with more than one set of results?",
                "Is it possible to submit multiple sets of results?",
                "How many sets of results can I apply with?"
            ],
            "responses": [
                "Yes. You can apply with up to 3 sets of results.",
                "You can apply with up to 3 sets of results."
            ]
        },
        {
            "tag": "application_forms_deadline",
            "patterns": [
                "Can the application forms get finished before the deadline?",
                "Is it possible for the application forms to run out before the deadline?",
                "Should I be concerned about the application forms running out?"
            ],
            "responses": [
                "No. Please note that the e-voucher is generated from the Banks’ system and cannot get finished."
            ]
        },
        {
            "tag": "passport_photo_background_colour",
            "patterns": [
                "What should the background colour of the passport photograph be?",
                "Is there a specific background colour for the passport photograph?",
                "What background is allowed for the passport photograph?"
            ],
            "responses": [
                "The background colour of the passport photograph should be white."
            ]
        },
        {
            "tag": "visit_application_document",
            "patterns": [
                "Can I visit my application document after I have finished filling the form online? If so, till when?",
                "Is it possible to access my application document once it's completed?",
                "When can I view my application document after submission?"
            ],
            "responses": [
                "Yes. Until the May/June WASSCE results are published, you can go back to your application form as many times as possible, either to view or to make changes."
            ]
        },
        {
            "tag": "difficulty_logging_in",
            "patterns": [
                "What do I do if I have difficulty logging in?",
                "How can I resolve login issues?",
                "I'm having trouble logging in, what should I do?"
            ],
            "responses": [
                "Try logging in after 8 p.m. or late at night when the number of people trying to log in will have reduced."
            ]
        },
        {
            "tag": "distance_education_application",
            "patterns": [
                "Is the application process for Distance Education the same as for programmes on the main campus?",
                "Do I follow the same application process for Distance Education as for regular programs?",
                "Is the application procedure different for Distance Education?"
            ],
            "responses": [
                "Yes, it is."
            ]
        },
        {
            "tag": "application_e_vouchers",
            "patterns": [
                "Where can one get the University of Ghana application e-vouchers to buy?",
                "Which banks provide the application e-vouchers?",
                "How can I purchase the University of Ghana application e-voucher?"
            ],
            "responses": [
                "You can purchase the e-voucher from any of the following banks:\nEcobank\nAgricultural Development Bank\nRepublic Bank\nPrudential Bank\nFidelity Bank\nUniversal Merchant Bank\nGCB Bank\nConsolidated Bank Ghana (CBG)\nZenith Bank\nYou can also purchase e-voucher using the Momo short code *187*18# on all networks."
            ]
        },
        {
            "tag": "nov/dec_results_admission",
            "patterns": [
                "Do you admit students with Nov/Dec results?",
                "Are applicants with Nov/Dec results eligible for admission?",
                "Can I apply with Nov/Dec results?"
            ],
            "responses": [
                "Yes, we do."
            ]
        },
        {
            "tag": "may/june_wassce_eligibility",
            "patterns": [
                "I am writing WASSCE in May/June this year. Can I apply?",
                "Is it possible to apply with May/June WASSCE results of the current year?",
                "Can I submit my application if I will be taking the WASSCE in May/June?"
            ],
            "responses": [
                "Yes. Anyone writing WASSCE in May/June this year is eligible to apply."
            ]
        },
        {
            "tag": "nov/dec_results_eligibility",
            "patterns": [
                "I will be writing NOV/DEC this year. Can I apply?",
                "Can I submit an application if I will be taking the NOV/DEC exams this year?",
                "Is it possible to apply with pending NOV/DEC results?"
            ],
            "responses": [
                "No. Admissions will be released before the NOV/DEC results are out."
            ]
        },
        {
            "tag": "total_wassce_results",
            "patterns": [
                "How many WASSCE results does University of Ghana take in total?",
                "What is the maximum number of WASSCE results considered for admission?",
                "How many sets of WASSCE results are allowed?"
            ],
            "responses": [
                "University of Ghana takes a total of three sittings\n- Accepts all Past WASSCE & SSCE results\n- Accepts a combination May/June & Nov/Dec Results\n- Accepts a combination of WASSCE & SSCE\n- Awaiting candidates can indicate their past WASSCE/SSCE results if they have one."
            ]
        },
        {
            "tag": "nov/dec_results_application",
            "patterns": [
                "I will be writing NOV/DEC this year, can I apply for admissions?",
                "Is it possible to apply with NOV/DEC results?",
                "Can I submit my application with pending NOV/DEC results?"
            ],
            "responses": [
                "Unfortunately, you cannot as the application will be processed before NOV/DEC results are released by WAEC."
            ]
        },
        {
            "tag": "wassce_results_entry",
            "patterns": [
                "Do I have to enter my WASSCE results when applying?",
                "Is it necessary to input my WASSCE results during the application process?",
                "Should I provide my WASSCE grades on the application form?"
            ],
            "responses": [
                "No. There is no need to enter your WASSCE results; instead, you are to enter your Index number, year, and month you wrote the WASSCE."
            ]
        },
        {
            "tag": "gender_cutoff_points",
            "patterns": [
                "Why are there different cut off points for males and females?",
                "What is the reason for having separate cut off points for males and females?",
                "Why are the admission thresholds different based on gender?"
            ],
            "responses": [
                "This is due to the affirmative action policy to encourage more females enrolling in tertiary education."
            ]
        },
        {
            "tag": "diploma_holders_acceptance",
            "patterns": [
                "Do you accept Diploma Holders from other tertiary institutions?",
                "Can I apply with a Diploma from a different university?",
                "Are Diploma holders from other institutions eligible for admission?"
            ],
            "responses": [
                "No. We only accept Diploma holders from the University of Ghana or as determined by the University. However, we accept HND holders from recognized Technical Universities into similar fields."
            ]
        },
        {
            "tag": "nursing_diploma_program",
            "patterns": [
                "Does the University of Ghana run a Diploma programme in Nursing?",
                "Is there a Diploma program in Nursing offered by the University of Ghana?",
                "Can I pursue a Diploma in Nursing at the University?"
            ],
            "responses": [
                "No. Diploma programs in Nursing are run by the various Nursing Training Colleges."
            ]
        },
        {
            "tag": "foreign_results_upload",
            "patterns": [
                "I am applying with foreign results aside WASSCE, do I have to scan and upload the results?",
                "Are scanned copies of foreign results required during the application process?",
                "Should I attach scanned foreign results to my application?"
            ],
            "responses": [
                "Yes. You have to scan and attach your results slip and indicate the details of the results."
            ]
        },
        {
            "tag": "application_form_submission",
            "patterns": [
                "Do I have to post my applications forms to the University after application?",
                "Is sending the application form by post required?",
                "Should I mail the completed application forms to the University?"
            ],
            "responses": [
                "Applications are strictly done online."
            ]
        },
        {
            "tag": "admission_confirmation",
            "patterns": [
                "How do I know I have gained admission into the University of Ghana?",
                "What is the confirmation process for successful admission?",
                "How can I confirm that I have been admitted?"
            ],
            "responses": [
                "Successful applicants will receive a text message based on the contact details they provided and if not, they should check for their status on the University Website."
            ]
        },
        {
            "tag": "post_admission_steps",
            "patterns": [
                "After I have gained admission to University of Ghana, what is the next step for me?",
                "What should I do after receiving an admission offer from University of Ghana?",
                "What are the subsequent steps following admission?"
            ],
            "responses": [
                "Download your provisional admission letter by entering your Serial Number and Pin.\nRead carefully the instructions on your admission letter and when duly satisfied, you can make payment of your fees at the bank.\nAfter making the payment, be checking from the University website for any new announcement regarding accommodation, orientation, registration, matriculation, and lectures."
            ]
        },
        {
            "tag": "application_changes",
            "patterns": [
                "Can I make changes after I have submitted my application online?",
                "Is it possible to edit the application after submission?",
                "Can I update my application details after I've already submitted?"
            ],
            "responses": [
                "Yes, you can. The University will also reopen the application portal for a few days to enable applicants to review their application after the release of the May/June WASSCE results.\nApplicants must ensure that their Biographical Data, WAEC Index Number, Year, and month of the examination are correct."
            ]
        },
        {
            "tag": "fee_payment_difference",
            "patterns": [
                "What is the difference between regular and fee-paying?",
                "How does fee-paying differ from regular admission?",
                "Can you explain the distinction between fee-paying and regular admission?"
            ],
            "responses": [
                "The difference is the amount of fees paid to the University. A student is considered admission into a fee-paying programme if he or she did not meet the regular cutoff point."
            ]
        },
        {
            "tag": "foreign_ghanaian_student_fees",
            "patterns": [
                "Do Ghanaians with foreign educational backgrounds pay foreign student fees?",
                "Are Ghanaians with foreign education considered as international students?",
                "What fees do Ghanaians with foreign education pay?"
            ],
            "responses": [
                "No. Ghanaians with foreign educational backgrounds pay regular Ghanaian fees once they are able to prove that they are Ghanaians."
            ]
        },
        {
            "tag": "admission_deferment",
            "patterns": [
                "I have gained admission to University of Ghana but will not be able to come to school this year, is my admission valid for the following year?",
                "Can I defer my admission to the next academic year?",
                "What if I can't attend this year after gaining admission?"
            ],
            "responses": [
                "No. You have to pay the required fees and write a letter to the University requesting for deferment of your admission."
            ]
        },
        {
            "tag": "accra_to_legon_campus_transfer",
            "patterns": [
                "I gained admission into the Accra City Campus. Can I change to the Legon Campus in the future?",
                "Is it possible to transfer from Accra City Campus to Legon Campus?",
                "Can I switch my campus from Accra to Legon after admission?"
            ],
            "responses": [
                "No please."
            ]
        },
        {
            "tag": "entry_requirements",
            "patterns": [
                "What are the general entry requirements for admission?",
                "What are the basic admission criteria?",
                "What do I need to qualify for admission?"
            ],
            "responses": [
                "An applicant for admission to a degree programme in the University of Ghana must have at least credits (A1 - C6 in WASSCE or A– D in SSSCE) in English, Core Mathematics and Integrated Science (for Science applicants) or Social Studies (for non-Science applicants).\nAlso, applicants must have three elective subjects in Science for those applying to Science or Agriculture related disciplines or three elective subjects in General Arts/Business for applicants applying to non-Science related disciplines, with the total aggregate not exceeding 24 for full-time programmes. For Distance Learning, the total aggregate should not exceed 30.\nIn addition, Science applicants should have at least a grade C6 in WASSCE (D in SSSCE) in Social Studies/Life Skills and non-Science applicants should also have at least a grade C6 in WASSCE (D in SSSCE) in Integrated Science/Core Science."
            ]
        },
        {
            "tag": "integrated_science_social_studies",
            "patterns": [
                "Do you use Integrated Science or Social Studies in calculating the aggregate for Science students?",
                "Which subject is used for calculating the aggregate for Science students, Integrated Science or Social Studies?",
                "Is Integrated Science or Social Studies considered for Science students' aggregate?"
            ],
            "responses": [
                "In the calculation of aggregates, Integrated Science will be used for Science programmes and Social Studies for non-science programmes. However, all applicants must have at least credit passes in both Integrated Science and Social Studies."
            ]
        },
        {
            "tag": "home_economics_programs",
            "patterns": [
                "Can a Home Economics student apply for Bsc Dietetics or Biological Sciences?",
                "Are Home Economics students eligible for Bsc Dietetics or Biological Sciences?",
                "Can Home Economics students pursue Bsc Dietetics or Biological Sciences?"
            ],
            "responses": [
                "No. Dietetics is a programme for pure science students and is run by the School of Biomedical & Allied Health Sciences, College of Health Sciences. The entry requirements are Credit passes in Three (3) Electives comprising Chemistry, Physics and either Biology or Elective Mathematics."
            ]
        },
        {
            "tag": "home_economics_nursing",
            "patterns": [
                "Can Home Economics students apply for Nursing or Midwifery?",
                "Are Home Economics students eligible for Nursing or Midwifery programs?",
                "Can students from Home Economics background pursue Nursing or Midwifery?"
            ],
            "responses": [
                "Yes, they can."
            ]
        },
        {
            "tag": "business_programs",
            "patterns": [
                "What programs are available to Business students?",
                "Can you list the programs that Business students can apply for?",
                "What options are open to students with a Business background?"
            ],
            "responses": [
                "Business students can apply for the following programmes:\n- B.Sc. Administration\n- Bachelor of Laws (LLB)\n- Bachelor of Arts"
            ]
        },
        {
            "tag": "business_administration_admission",
            "patterns": [
                "Do you favour Business students when admitting into Business Administration?",
                "Is there a preference for Business students in Business Administration admission?",
                "Are Business students given priority for Business Administration?"
            ],
            "responses": [
                "The entry requirement into Business Administration is ‘Any Three Elective subjects.\nThe background does not matter once you meet the cutoff point."
            ]
        },
        {
            "tag": "b_a_option_business_school",
            "patterns": [
                "Is there a B. A. option at the Business School?",
                "Does the Business School offer a Bachelor of Arts (B. A.) option?",
                "Can I pursue a B. A. program at the Business School?"
            ],
            "responses": [
                "Yes. From the 2016/2017 academic year, the Bachelor of Arts in Administration (B. A. Admin) programme has been reintroduced."
            ]
        },
        {
            "tag": "admission_screening_process",
            "patterns": [
                "Do I have to go through any screening process before I gain admission?",
                "Is there a screening procedure for admission?",
                "What kind of screening is required before admission?"
            ],
            "responses": [
                "A programme like Bachelor of Fine Arts requires you to attend an audition before gaining admission.\nSome programmes in the College of Health Sciences also require applicants to write entrance examinations and/or attend an interview.\nThe list of successful applicants invited for screening will be published on the university website."
            ]
        },
        {
            "tag": "fee_paying_programme_cutoff",
            "patterns": [
                "Can I gain admissions into a fee-paying programme if I fall below the admissions cut off point for my programme of choice?",
                "Is it possible to be admitted to a fee-paying program with an aggregate below the cutoff?",
                "Can I be admitted into a fee-paying program if my aggregate is low?"
            ],
            "responses": [
                "Yes, an applicant may gain admission into a fee-paying programme for failing to meet the required admissions cut off point."
            ]
        },
        {
            "tag": "aggregate_more_than_24",
            "patterns": [
                "My aggregate is more than 24 and I have all the required credit passes (C6), can I apply for a regular programme or as fee paying?",
                "Is it possible to apply for regular admission or as a fee-paying student with an aggregate above 24?",
                "Can I choose between regular admission and fee-paying admission with an aggregate exceeding 24?"
            ],
            "responses": [
                "No please, any aggregate more than 24 will qualify you for Distance Education, which is run on weekends in all the regional learning centers and is the same four-year degree programme."
            ]
        },
        {
            "tag": "agric_science_veterinary_medicine",
            "patterns": [
                "Can Agric Science students apply for the Doctor of Veterinary Medicine programme?",
                "Are students with an Agricultural Science background eligible for the Doctor of Veterinary Medicine program?",
                "Can I pursue the Doctor of Veterinary Medicine program with a background in Agricultural Science?"
            ],
            "responses": [
                "No please, the requirement for this programme is Biology, Chemistry and either Physics or Elective Mathematics."
            ]
        },
        {
            "tag": "distance_learning_programs",
            "patterns": [
                "What programmes do you offer for Distance Learning?",
                "Can you list the programs available for Distance Learning?",
                "Which programs are offered through Distance Learning?"
            ],
            "responses": [
                "Programmes offered at Distance Learning are:\n- B.Sc. Administration\n- Bachelor of Arts\n- B. Sc. Information Technology\n- B. Sc. Nursing (For professional nurses only)."
            ]
        },
        {
            "tag": "accra_city_campus_programs",
            "patterns": [
                "What programmes do you offer at the Accra City Campus?",
                "Can you list the programs available at the Accra City Campus?",
                "Which programs are offered at the Accra City Campus?"
            ],
            "responses": [
                "Programmes on offer at the Accra City Campus are:\n- B.Sc. Administration\n- Bachelor of Arts"
            ]
        },
        {
            "tag": "program_change_after_first_year",
            "patterns": [
                "Can I change my programme after the first year?",
                "Is it possible to switch programs after completing the first year?",
                "Can I transfer to a different program after the initial year?"
            ],
            "responses": [
                "No, you cannot."
            ]
        },



        
          {
              "tag": "medicine_surgery",
              "patterns": [
                  "What are the entry requirements for Bachelor of Medicine and Bachelor of Surgery?",
                  "Can you provide the admission criteria for MBChB?",
                  "What are the prerequisites for studying Medicine and Surgery?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Medicine and Bachelor of Surgery (MBChB):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry and any two from Physics, Biology and Elective Mathematics"
              ]
          },
          {
              "tag": "dental_surgery",
              "patterns": [
                  "What are the entry requirements for Bachelor of Dental Surgery?",
                  "Can you provide the admission criteria for BDS?",
                  "What are the prerequisites for studying Dental Surgery?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Dental Surgery (BDS):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry and any two from Physics, Biology and Elective Mathematics"
              ]
          },
          {
              "tag": "pharmacy",
              "patterns": [
                  "What are the entry requirements for Doctor of Pharmacy?",
                  "Can you provide the admission criteria for PharmD?",
                  "What are the prerequisites for studying Pharmacy?"
              ],
              "responses": [
                  "Entry requirements for Doctor of Pharmacy (PharmD):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry, Biology and either Physics or Elective Mathematics"
              ]
          },
          {
              "tag": "dietetics_medical_laboratory",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Dietetics?",
                  "Can you provide the admission criteria for Dietetics program?",
                  "What are the prerequisites for studying Medical Laboratory Science?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Dietetics:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry, Physics and either Biology or Elective Mathematics"
              ]
          },
          {
              "tag": "occupational_physio_radiography",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Occupational Therapy?",
                  "Can you provide the admission criteria for Occupational Therapy?",
                  "What are the prerequisites for studying Physiotherapy?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Occupational Therapy:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry, Physics and either Biology or Elective Mathematics"
              ]
          },
          {
              "tag": "respiratory_therapy",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Respiratory Therapy?",
                  "Can you provide the admission criteria for Respiratory Therapy?",
                  "What are the prerequisites for studying Respiratory Therapy?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Respiratory Therapy:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry, Physics and either Biology or Elective Mathematics"
              ]
          },
          {
              "tag": "nursing_options",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Nursing with options?",
                  "Can you provide the admission criteria for Nursing program with options?",
                  "What are the prerequisites for studying Nursing with various options?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Nursing with options:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in three electives from any specified combinations"
              ]
          },
          {
              "tag": "midwifery",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Midwifery?",
                  "Can you provide the admission criteria for Midwifery program?",
                  "What are the prerequisites for studying Midwifery?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Midwifery:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in three electives from any specified combinations"
              ]
          },
          {
              "tag": "public_health",
              "patterns": [
                  "What are the entry requirements for Bachelor of Public Health?",
                  "Can you provide the admission criteria for Public Health program?",
                  "What are the prerequisites for studying Public Health?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Public Health:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in three electives from any specified combinations"
              ]
          },
          {
              "tag": "mathematical_physical_sciences",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Physical Sciences?",
                  "Can you provide the admission criteria for Physical Sciences program?",
                  "What are the prerequisites for studying Physical Sciences?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Physical Sciences:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Physics, Chemistry, and Elective Mathematics"
              ]
          },
          {
              "tag": "mathematical_sciences",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Mathematical Sciences?",
                  "Can you provide the admission criteria for Mathematical Sciences program?",
                  "What are the prerequisites for studying Mathematical Sciences?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Mathematical Sciences:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Elective Mathematics and any two subjects with at least a B3 in Elective Mathematics and Core Mathematics"
              ]
          },
          {
              "tag": "earth_sciences",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Earth Sciences?",
                  "Can you provide the admission criteria for Earth Sciences program?",
                  "What are the prerequisites for studying Earth Sciences?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Earth Sciences:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry and any two of Physics, Biology/Geography and Elective Mathematics"
              ]
          },
          {
              "tag": "information_technology",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Information Technology?",
                  "Can you provide the admission criteria for Information Technology program?",
                  "What are the prerequisites for studying Information Technology?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Information Technology:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three subjects, with at least a B3 in Core Mathematics"
              ]
          },
          {
              "tag": "biological_sciences",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Biological Sciences?",
                  "Can you provide the admission criteria for Biological Sciences program?",
                  "What are the prerequisites for studying Biological Sciences?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Biological Sciences:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry, Physics, and Biology"
              ]
          },
          {
              "tag": "psychology",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Psychology?",
                  "Can you provide the admission criteria for Psychology program?",
                  "What are the prerequisites for studying Psychology?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Psychology:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Biology and Elective Mathematics and any one of Physics and Chemistry"
              ]
          },
          {
              "tag": "agriculture",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Agriculture?",
                  "Can you provide the admission criteria for Agriculture program?",
                  "What are the prerequisites for studying Agriculture?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Agriculture:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry and any two of Physics, Biology/Agriculture Science, Geography and Elective Mathematics"
              ]
          },
          {
              "tag": "family_consumer_sciences_food_clothing",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Family & Consumer Sciences (Food and Clothing Option)?",
                  "Can you provide the admission criteria for Family & Consumer Sciences (Food and Clothing) program?",
                  "What are the prerequisites for studying Family & Consumer Sciences with Food and Clothing Option?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Family & Consumer Sciences (Food and Clothing Option):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Home Science Background: Credit passes in Management in Living and Chemistry, and either Food and Nutrition or Textile and Clothing\nScience Background: Credit passes in Chemistry and any two Elective Subjects"
              ]
          },
          {
              "tag": "family_consumer_sciences_family_child_studies",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Family & Consumer Sciences (Family and Child Studies Option)?",
                  "Can you provide the admission criteria for Family & Consumer Sciences (Family and Child Studies) program?",
                  "What are the prerequisites for studying Family & Consumer Sciences with Family and Child Studies Option?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Family & Consumer Sciences (Family and Child Studies Option):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit pass in Management in Living and any two of the following: Food and Nutrition, Textiles and Clothing, General Knowledge in Art, Biology or Chemistry."
              ]
          },
          {
              "tag": "engineering_sciences_agriculture",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Engineering Sciences (Agriculture Engineering Option)?",
                  "Can you provide the admission criteria for Engineering Sciences (Agriculture Engineering) program?",
                  "What are the prerequisites for studying Engineering Sciences with Agriculture Engineering Option?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Engineering Sciences (Agriculture Engineering Option):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Physics, Chemistry and Elective Mathematics, with at least a B3 in Elective Mathematics"
              ]
          },
          {
              "tag": "engineering_sciences_biomedical",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Engineering Sciences (Biomedical Engineering Option)?",
                  "Can you provide the admission criteria for Engineering Sciences (Biomedical Engineering) program?",
                  "What are the prerequisites for studying Engineering Sciences with Biomedical Engineering Option?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Engineering Sciences (Biomedical Engineering Option):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Physics, Chemistry and Elective Mathematics, with at least a B3 in Elective Mathematics"
              ]
          },
          {
              "tag": "engineering_sciences_computer",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Engineering Sciences (Computer Engineering Option)?",
                  "Can you provide the admission criteria for Engineering Sciences (Computer Engineering) program?",
                  "What are the prerequisites for studying Engineering Sciences with Computer Engineering Option?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Engineering Sciences (Computer Engineering Option):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Physics, Chemistry and Elective Mathematics, with at least a B3 in Elective Mathematics"
              ]
          },
          {
              "tag": "engineering_sciences_food_process",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Engineering Sciences (Food Process Engineering Option)?",
                  "Can you provide the admission criteria for Engineering Sciences (Food Process Engineering) program?",
                  "What are the prerequisites for studying Engineering Sciences with Food Process Engineering Option?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Engineering Sciences (Food Process Engineering Option):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Physics, Chemistry, and Elective Mathematics, with at least a B3 in Elective Mathematics"
              ]
          },
          {
              "tag": "engineering_sciences_materials",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Engineering Sciences (Materials Science & Engineering Option)?",
                  "Can you provide the admission criteria for Engineering Sciences (Materials Science & Engineering) program?",
                  "What are the prerequisites for studying Engineering Sciences with Materials Science & Engineering Option?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Engineering Sciences (Materials Science & Engineering Option):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Physics, Chemistry, and Elective Mathematics, with at least a B3 in Elective Mathematics"
              ]
          },
          {
              "tag": "veterinary_medicine",
              "patterns": [
                  "What are the entry requirements for Doctor of Veterinary Medicine?",
                  "Can you provide the admission criteria for Veterinary Medicine program?",
                  "What are the prerequisites for studying Veterinary Medicine?"
              ],
              "responses": [
                  "Entry requirements for Doctor of Veterinary Medicine:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Biology, Chemistry, and either Physics or Elective Mathematics"
              ]
          },
          {
              "tag": "humanities_arts_languages",
              "patterns": [
                  "What are the entry requirements for Bachelor of Arts?",
                  "Can you provide the admission criteria for Arts program?",
                  "What are the prerequisites for studying Arts?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Arts:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects"
              ]
          },
          {
              "tag": "business_administration",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Business Administration?",
                  "Can you provide the admission criteria for Business Administration program?",
                  "What are the prerequisites for studying Business Administration?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Business Administration:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects"
              ]
          },
          {
              "tag": "law",
              "patterns": [
                  "What are the entry requirements for Bachelor of Laws (LLB)?",
                  "Can you provide the admission criteria for LLB program?",
                  "What are the prerequisites for studying Law?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Laws (LLB):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects"
              ]
          },
          {
              "tag": "performing_arts",
              "patterns": [
                  "What are the entry requirements for Bachelor of Fine Arts?",
                  "Can you provide the admission criteria for Fine Arts program?",
                  "What are the prerequisites for studying Fine Arts?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Fine Arts:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three electives subjects. The program is open to applicants interested in the Performing Arts with aggregate 24 or better. They will be expected to attend an audition or interview."
              ]
          },
          {
              "tag": "education_leadership",
              "patterns": [
                  "What are the entry requirements for BA Education (English)?",
                  "Can you provide the admission criteria for Education (English) program?",
                  "What are the prerequisites for studying Education (English)?"
              ],
              "responses": [
                  "Entry requirements for BA Education (English):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects including English Literature."
              ]
          },
          {
              "tag": "education_non_teaching",
              "patterns": [
                  "What are the entry requirements for BA Education (Non-Teaching)?",
                  "Can you provide the admission criteria for Education (Non-Teaching) program?",
                  "What are the prerequisites for studying Education (Non-Teaching)?"
              ],
              "responses": [
                  "Entry requirements for BA Education (Non-Teaching):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects."
              ]
          },
          {
              "tag": "education_sport_physical_culture",
              "patterns": [
                  "What are the entry requirements for BA Sport and Physical Culture Studies?",
                  "Can you provide the admission criteria for Sport and Physical Culture Studies program?",
                  "What are the prerequisites for studying Sport and Physical Culture Studies?"
              ],
              "responses": [
                  "Entry requirements for BA Sport and Physical Culture Studies:\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects"
              ]
          },
          {
              "tag": "education_mathematics",
              "patterns": [
                  "What are the entry requirements for B.Sc. Education (Mathematics)?",
                  "Can you provide the admission criteria for Education (Mathematics) program?",
                  "What are the prerequisites for studying Education (Mathematics)?"
              ],
              "responses": [
                  "Entry requirements for B.Sc. Education (Mathematics):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Elective Mathematics and any other two elective subjects"
              ]
          },
          {
              "tag": "education_biology",
              "patterns": [
                  "What are the entry requirements for B.Sc. Education (Biology)?",
                  "Can you provide the admission criteria for Education (Biology) program?",
                  "What are the prerequisites for studying Education (Biology)?"
              ],
              "responses": [
                  "Entry requirements for B.Sc. Education (Biology):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Biology and any other two elective subjects"
              ]
          },
          {
              "tag": "education_chemistry",
              "patterns": [
                  "What are the entry requirements for B.Sc. Education (Chemistry)?",
                  "Can you provide the admission criteria for Education (Chemistry) program?",
                  "What are the prerequisites for studying Education (Chemistry)?"
              ],
              "responses": [
                  "Entry requirements for B.Sc. Education (Chemistry):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Chemistry and any other two elective subjects"
              ]
          },
          {
              "tag": "education_physics",
              "patterns": [
                  "What are the entry requirements for B.Sc. Education (Physics)?",
                  "Can you provide the admission criteria for Education (Physics) program?",
                  "What are the prerequisites for studying Education (Physics)?"
              ],
              "responses": [
                  "Entry requirements for B.Sc. Education (Physics):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in Physics and any other two elective subjects"
              ]
          },
          {
              "tag": "distance_education_business_administration",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Business Administration (Distance Education)?",
                  "Can you provide the admission criteria for Business Administration (Distance Education) program?",
                  "What are the prerequisites for studying Business Administration through Distance Education?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Business Administration (Distance Education):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects with the total aggregate not exceeding 24"
              ]
          },
          {
              "tag": "distance_education_arts",
              "patterns": [
                  "What are the entry requirements for Bachelor of Arts (Distance Education)?",
                  "Can you provide the admission criteria for Arts (Distance Education) program?",
                  "What are the prerequisites for studying Arts through Distance Education?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Arts (Distance Education):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects with the total aggregate not more than 30"
              ]
          },
          {
              "tag": "distance_education_information_technology",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Information Technology (Distance Education)?",
                  "Can you provide the admission criteria for Information Technology (Distance Education) program?",
                  "What are the prerequisites for studying Information Technology through Distance Education?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Information Technology (Distance Education):\nCore: Credit passes in English, Core Mathematics, Integrated Science & Social Studies\nElectives: Credit passes in any three elective subjects with the total aggregate not exceeding 30"
              ]
          },
          {
              "tag": "distance_education_nursing",
              "patterns": [
                  "What are the entry requirements for Bachelor of Science in Nursing (Distance Education)?",
                  "Can you provide the admission criteria for Nursing (Distance Education) program?",
                  "What are the prerequisites for studying Nursing through Distance Education?"
              ],
              "responses": [
                  "Entry requirements for Bachelor of Science in Nursing (Distance Education):\nApplicants must be professional nurses who already have a Diploma in Nursing from a recognized Nursing Training College, with a Final Grade Point Average (FGPA) OF 2.5 or better."
              ]
          },



          
            {
              "tag": "college_health_sciences",
              "patterns": [
                "What programs are available in the College of Health Sciences?",
                "Tell me about the programs offered in the College of Health Sciences.",
                "List the departments and programs in the College of Health Sciences."
              ],
              "responses": [
                "In the College of Health Sciences at the University of Ghana, the following programs are available:\n\n- University of Ghana Medical School: Bachelor of Medicine and Bachelor of Surgery\n- University of Ghana Dental School: Bachelor of Dental Surgery\n- School of Pharmacy: Doctor of Pharmacy (PharmD)\n- School of Biomedical and Allied Health Sciences: Bachelor of Science in Dietetics, Medical Laboratory, Occupational Therapy, Physiotherapy, Radiography\n- School of Nursing & Midwifery: Bachelor of Science in Nursing, Bachelor of Science in Midwifery\n- School of Public Health: Bachelor of Public Health in various specializations."
              ]
            },
            {
              "tag": "college_basic_applied_sciences",
              "patterns": [
                "What programs are offered in the College of Basic & Applied Sciences?",
                "Tell me about the programs in the College of Basic & Applied Sciences.",
                "List the groupings and programs in the College of Basic & Applied Sciences."
              ],
              "responses": [
                "The College of Basic & Applied Sciences at the University of Ghana offers the following groupings and programs:\n\n- Group 1: Physical Sciences (Physics, Chemistry, Geophysics)\n- Group 2: Mathematical Sciences (Mathematics, Statistics, Actuarial Science, Computer Science, Biomathematics, Physics)\n- Group 3: Earth Sciences (Geology, Applied Geology, Applied Geophysics)\n- Group 4: Information Technology\n- Group 5: Biological Sciences (Animal Biology and Conservation Science, Biochemistry Cell and Molecular Biology, Nutrition, Food Science, Plant and Environmental Biology, Marine Science, Fisheries Science, Psychology, Microbiology)\n- Group 6: Agriculture (Animal Science, Crop Science, Soil Science, Agriculture Economics, Agribusiness, Agriculture Extension, Post-Harvest Technology)\n- Group 7: Family and Consumer Science (Food and Clothing Option)\n- Group 8: Family and Consumer Science (Family and Child Studies Option)\n- Group 9: Engineering Sciences (Material Science and Engineering, Computer Engineering, Biomedical Engineering, Food Process Engineering, Agriculture Engineering)\n- Group 10: Doctor of Veterinary Medicine"
              ]
            },
            {
              "tag": "college_humanities",
              "patterns": [
                "What programs can I find in the College of Humanities?",
                "Tell me about the programs offered by the College of Humanities.",
                "List the schools and programs in the College of Humanities."
              ],
              "responses": [
                "In the College of Humanities at the University of Ghana, you can find the following programs:\n\n- University of Ghana Business School: Bachelor of Science in Business Administration\n- University of Ghana School of Law: Bachelor of Laws (LLB)\n- School of Arts: Bachelor of Arts in various departments (Religions, Philosophy and Classics, History, Archaeology and Heritage Studies)\n- School of Languages: Bachelor of Arts in various departments (English, French, Modern Languages, Linguistics)\n- School of Social Sciences: Bachelor of Arts in various departments (Economics, Political Science, Sociology, Geography and Resource Development, Social Work, Psychology)\n- School of Performing Arts: Bachelor of Fine Arts/Bachelor of Arts in various departments (Dance Studies, Theatre Arts, Music)"
              ]
            },
            {
              "tag": "college_education",
              "patterns": [
                "What are the programs available in the College of Education?",
                "Tell me about the programs offered in the College of Education.",
                "List the schools and programs in the College of Education."
              ],
              "responses": [
                "The College of Education at the University of Ghana offers the following programs:\n\n- School of Information and Communication Studies: Bachelor of Arts in Information Studies\n- School of Education and Leadership: Bachelor of Arts/Bachelor of Science in Education (English, Linguistics, Information Studies, Psychology, Social Work, Sociology, Adult Education), Bachelor of Science in Education (Biology, Chemistry, Physics, Mathematics, Statistics), Bachelor of Education with various specialisms\n- School of Continuing and Distance Education: Bachelor of Science in Business Administration, Bachelor of Arts in various departments (Economics, Political Science, Sociology, Psychology, Information Studies, Adult Education and Human Resource Studies), Bachelor of Science in Information Technology, Bachelor of Science in Nursing (for professional nurses with a Diploma in Nursing)"
              ]
            },
          
          
            
              {
                "tag": "cut_off_points",
                "patterns": [
                  "What are the cut-off points for the BSc. Biological Sciences program?",
                  "What are the subject requirements for BSc. Earth Sciences?",
                  "What is the cut-off point for BSc. Biomedical Engineering?"
                ],
                "responses": [
                  "For the BSc. Biological Sciences program, the cut-off point is 20 (22) for the 1st Choice and 15 (17) for the 2nd Choice. The subject requirement is C6 in Chemistry.",
                  "The subject requirements for BSc. Earth Sciences are a cut-off point of 24 and 16 (18) for the 1st and 2nd Choices respectively. Additionally, C6 in Chemistry & Physics is required.",
                  "The cut-off point for BSc. Biomedical Engineering is 9(10) for regular admission and 12 for full-fee paying admission. The subject requirement is B3 in Elective Maths."
                ]
              },
              {
                "tag": "health_sciences_cut_off",
                "patterns": [
                  "What is the cut-off point for the Bachelor of Medicine and Bachelor of Surgery program?",
                  "What are the cut-off points for BSc. Physiotherapy?",
                  "What is the required cut-off for BSc. Nursing?"
                ],
                "responses": [
                  "The cut-off point for the Bachelor of Medicine and Bachelor of Surgery program is 7.",
                  "For BSc. Physiotherapy, the cut-off points are 14 and 13 for regular and full-fee paying admissions respectively.",
                  "The required cut-off point for BSc. Nursing is 9."
                ]
              },
              {
                "tag": "education_cut_off",
                "patterns": [
                  "What are the cut-off points for BSc. Education?",
                  "What is the cut-off point for BA. Education (English)?"
                ],
                "responses": [
                  "The cut-off points for BSc. Education are 24.",
                  "The cut-off point for BA. Education (English) is 24."
                ]
              },
              {
                "tag": "humanities_cut_off",
                "patterns": [
                  "What is the cut-off point for Bachelor of Laws?",
                  "What are the cut-off points for Bachelor of Fine Arts?",
                  "What is the cut-off point for Bachelor of Arts (Business/Science/ Vocational Background)?"
                ],
                "responses": [
                  "The cut-off point for Bachelor of Laws is 7.",
                  "The cut-off points for Bachelor of Fine Arts is 22.",
                  "The cut-off point for Bachelor of Arts (Business/Science/ Vocational Background) is 12."
                ]
              },
            
              
                {
                  "tag": "contact_info",
                  "patterns": [
                    "How can I contact the Admissions Unit?",
                    "What is the email address for the College of Health Sciences?",
                    "How do I reach out to the College of Humanities?"
                  ],
                  "responses": [
                    "You can contact the Admissions Unit at admissions@ug.edu.gh. Phone numbers: 0302 213820 ext 6018, 0302 213820 ext 2637. WhatsApp Number: 0200480344.",
                    "The email address for the College of Health Sciences is academicaffairs@chs.edu.gh. You can also reach them by mail at P. O. Box KB 52, Korle-Bu, Accra. Phone numbers: 0268420215, 0550202911.",
                    "To contact the College of Humanities, you can email them at cohacademic@ug.edu.gh. You can also send mail to P. O. Box LG 1173, Legon. Phone numbers: 0507178028, 0552899445, 0307080628."
                  ]
                },
                {
                  "tag": "college_contact",
                  "patterns": [
                    "How can I get in touch with the College of Basic & Applied Sciences?",
                    "What is the contact information for the College of Education?"
                  ],
                  "responses": [
                    "For the College of Basic & Applied Sciences, you can contact them at cbasadmissions@ug.edu.gh. Mail can be sent to P. O. Box LG 1195, Legon. Phone number: 020 645 0182.",
                    "To reach out to the College of Education, you can email them at coeacademic@ug.edu.gh. Mail can be sent to P. O. Box LG 1181, Legon. Phone number: 0200088432."
                  ]
                },


                
                  {
                    "tag": "application_info",
                    "patterns": [
                      "When does the academic year begin for undergraduate applications?",
                      "Who is eligible to apply for undergraduate applications?",
                      "What are the admission guidelines for the College of Health Sciences?"
                    ],
                    "responses": [
                      "The academic year for undergraduate applications begins in September.",
                      "All applicants who will be writing WASSCE in May/June 2022 are eligible to apply.",
                      "There is direct admission of applicants into all programmes offered by the College of Health Sciences as first choice only. For second and third choices, applicants are strongly advised to choose courses from the College of Basic and Applied Sciences."
                    ]
                  },
                  {
                    "tag": "programme_admission",
                    "patterns": [
                      "How many choices can applicants select for the School of Physical and Mathematical Sciences and the School of Biological Sciences?",
                      "What is the advice for applicants selecting B.Sc. Administration or Bachelor of Laws as their first choice?",
                      "What are the requirements for entering the Bachelor of Arts programme?"
                    ],
                    "responses": [
                      "Applicants can select up to four (4) choices in order of preference for the School of Physical and Mathematical Sciences and the School of Biological Sciences.",
                      "Applicants selecting B.Sc. Administration or Bachelor of Laws as their first choice are strongly advised to select bouquets from the Bachelor of Arts programme as second choice to enhance their chances of gaining admission.",
                      "For the Bachelor of Arts (BA) programme, applicants are required to select subjects from the list of bouquets provided. They must offer three (3) subjects at Level 100, two (2) subjects at Level 200 and Level 300, and either two (2) subjects or one (1) subject at Level 400."
                    ]
                  },
                  {
                    "tag": "admission_qualifications",
                    "patterns": [
                      "What is the admission level for holders of other qualifications like International Baccalaureate (IB), IGCSE, and the American Grade 12 examinations?",
                      "When did the University of Ghana stop admitting applicants with the West African Examination Council’s Ordinary and Advanced Level Certificates?"
                    ],
                    "responses": [
                      "Holders of other qualifications including International Baccalaureate (IB), IGCSE, and the American Grade 12 examinations which hitherto were admitted to Level 200, will be admitted to Level 100.",
                      "The University of Ghana ceased admitting applicants with the West African Examination Council’s Ordinary and Advanced Level Certificates since the 2007/2008 academic year."
                    ]
                  },
                  {
                    "tag": "application_fee",
                    "patterns": [
                      "How much is the non-refundable application processing fee?",
                      "What are the payment options for the application processing fee?"
                    ],
                    "responses": [
                      "All applicants are expected to pay a non-refundable application processing fee of US$110.00.",
                      "The fee can be paid online as part of the application process or wire transferred into the University of Ghana ECOBANK Account. Payments in Ghana can be made in cash to the University of Ghana Forex Account at Ecobank. International transfers can also be made through Ecobank using the provided account numbers."
                    ]
                  },
                  {
                    "tag": "submission_requirements",
                    "patterns": [
                      "What documents should be attached to the application form before submission?",
                      "Is proof of payment required for application processing?"
                    ],
                    "responses": [
                      "The pay-in-slips together with applicants certificates/result slips should be scanned and attached to the application form before submission online. The certificates/results slips should be scanned into one PDF or WORD document and attached to the application form.",
                      "Yes, no application will be processed without proof of payment of the fee."
                    ]
                  },
                
                
                  
                    {
                      "tag": "sub_degree_admissions",
                      "patterns": [
                        "When are the applications open for sub-degree programmes?",
                        "What are the available sub-degree programmes?",
                        "What are the entry requirements for diploma programmes?"
                      ],
                      "responses": [
                        "Applications are open for the admission of prospective applicants into certificate and various Diploma programmes for the 2022/2023 academic year.",
                        "The available sub-degree programmes are Certificate in English Proficiency and several Diploma programmes including Diploma in Accounting, Diploma in Public Administration, Diploma in Librarianship, Diploma in Adult Education, and Diploma in Youth and Development (CYP).",
                        "Applicants must satisfy the minimum requirements including passes (A-D) in six (6) subjects, including English Language and Mathematics for SSSCE holders. WASSCE holders need passes (A1-D7) in six (6) subjects, including English Language and Mathematics. Additionally, relevant passes are required for the area of specialization."
                      ]
                    },
                    {
                      "tag": "application_info",
                      "patterns": [
                        "How should Ghanaian applicants obtain University of Ghana online application E-VOUCHERS?",
                        "How should Ghanaians applying from abroad proceed with the application?",
                        "What is the non-refundable application processing fee?"
                      ],
                      "responses": [
                        "Ghanaian applicants can obtain University of Ghana online application E-VOUCHERS for GH¢200.00 at several banks including Ecobank, HFC Bank, ADB, GCB Bank, Zenith Bank, and more. After submitting the application online, the e-voucher should be kept safely for future reference.",
                        "Ghanaians applying from abroad should visit the University’s website at http://admission.ug.edu.gh and follow the instructions provided.",
                        "All applicants are expected to pay a non-refundable application processing fee of US$110.00. This fee can be paid directly or wire transferred into the University of Ghana ECOBANK Account."
                      ]
                    },
                    {
                      "tag": "payment_details",
                      "patterns": [
                        "What are the details of the University of Ghana ECOBANK Account for payment?",
                        "Can applicants pay the application processing fee with a credit card?"
                      ],
                      "responses": [
                        "Details of the University of Ghana ECOBANK Account for payment:\nAccount Name: University of Ghana Foreign Students Fees\nAccount Number: 2441000716652\nBank Details: Ecobank Ghana Limited, Legon Branch\nSwift: ECOCGHAC",
                        "Yes, applicants can make payment with a Credit Card on the GT payment platform."
                      ]
                    },
                    {
                      "tag": "submission_requirements",
                      "patterns": [
                        "What documents should be attached to the online application form before submission?",
                        "Is proof of payment required for the application to be processed?"
                      ],
                      "responses": [
                        "Relevant certificates are to be scanned and attached to the online application form. The pay-in-slips together with applicants’ certificates/result slips should be scanned into one PDF or WORD document and attached to the application form before submission.",
                        "Yes, no application will be processed without proof of payment of the fee."
                      ]
                    },
                    {
                      "tag": "application_deadline",
                      "patterns": [
                        "When is the deadline for submitting applications for Diploma Programmes?",
                        "When must applications for Diploma Programmes be submitted?"
                      ],
                      "responses": [
                        "Applications for Diploma Programmes must be submitted until WAEC Results are released."
                      ]
                    },

                    
                      {
                        "tag": "undergrad_admissions",
                        "patterns": [
                          "What are the requirements for undergraduate admissions for the 2023/2024 academic year?",
                          "What is the minimum Final Grade Point required for admission to the University of Ghana?",
                          "What is the minimum Final Grade Point for admission to the University of Ghana Medical School and Dental School?"
                        ],
                        "responses": [
                          "For undergraduate admissions for the 2023/2024 academic year, applicants must have a Final Grade Point of at least 3.0. For admission to the University of Ghana Medical School and the University of Ghana Dental School, an applicant must have a Final Grade Point of at least 3.25.",
                          "The minimum Final Grade Point required for admission to the University of Ghana is at least 3.0.",
                          "For admission to the University of Ghana Medical School and the University of Ghana Dental School, the minimum Final Grade Point required is at least 3.25."
                        ]
                      },
                      {
                        "tag": "admission_level",
                        "patterns": [
                          "At what level will admissions be for international applicants and Ghanaians with a foreign background?",
                          "What will be the entry level for international applicants and Ghanaians with a foreign background?"
                        ],
                        "responses": [
                          "Admissions for international applicants and Ghanaians with a foreign background will be to Level 100."
                        ]
                      },
                    
                                  
                      
                        {
                          "tag": "mature_access_course",
                          "patterns": [
                            "When does the registration for the University of Ghana mature access course for the 2023/2024 academic year begin and end?",
                            "What are the entry requirements for the mature access course?",
                            "How can applicants register for the University of Ghana Access Course?",
                            "What are the dates for the Access Course?",
                            "Where can I find further information about the mature access course?"
                          ],
                          "responses": [
                            "The registration for the University of Ghana mature access course for the 2023/2024 academic year starts from Monday, April 3 and ends on Friday, May 26, 2023.",
                            "To be eligible, applicants must be at least 25 years old at the time of application and provide proof of age with the ECOWAS/National ID Card or any legitimate documentary proof of date of birth which is at least 5 years old. They must also register for, attend, and complete the University of Ghana Access Course and pass the Mature Students’ Entrance Examination conducted by the University.",
                            "Applicants can make payment for the Access Course and Entrance Examination (GH¢500.00) into UG Learning Centre Account number 1441002010444 at any branch of ECOBANK Ghana Limited. After payment, they should register online on the University of Ghana Website or through https://apply.ug.edu.gh/admissions/mature. Only those who pass the entrance examination will be eligible to purchase the e-voucher to access the University’s online application form.",
                            "The Access Course is scheduled to run from April 15 to June 11, 2023. The course will be conducted on the following dates: April 15-16, April 22-23, April 29-30, May 6-7, May 13-14, May 20-21, May 27-28, June 3-4, and June 10-11.",
                            "For further information about the mature access course, applicants can visit the University’s website: www.ug.edu.gh or contact the College Academic Office at 0503899803, 0552996775, 0264410136, or email coeacademic@ug.edu.gh. They can also contact the Department of Distance Education at 0303938855, 0302956122, or email dde@ug.edu.gh."
                          ]
                        },
                        {
                          "tag": "learning_centre_contacts",
                          "patterns": [
                            "Can you provide contact information for specific learning centers?",
                            "How can I reach out to the University's learning centers?"
                          ],
                          "responses": [
                            "Certainly, here are the contact details for some of the University's learning centers:\nAccra: 0303944582, 0303970282\nTsito/Ho: 0201885987, 0249528434\nTema: 0244818069\nKoforidua: 0342290824, 0243654839, 0244771933\nTakoradi: 0203333233\nTamale: 0244045270\nKumasi: 0244743510\nBolgatanga: 0205191313\nSunyani: 0352027153, 0352026734, 0244453440\nCape Coast: 0332132100\nWa: 0206982380"
                          ]
                        },
                      
                                 
                  
      
    
      {
        "tag": "funny",
        "patterns": [
          "Tell me a joke!",
          "Tell me something funny!",
          "Do you know a joke?"
        ],
        "responses": [
          "Parallel lines have so much in common. It's a shame they'll never meet.",
          "What did the buffalo say when his son left for college? Bison.",
          "Why did the bicycle fall over? Because it was two-tired.",
          "Why don't oysters donate to charity? Because they're shellfish.",
          "I only know 25 letters of the alphabet. I don't know y.",
          "Want to hear a construction joke? Sorry, I'm still working on it."
        ]
      }
    ]
  }